STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/AudioUseCases/pbp.c
/**
  ******************************************************************************
  * @file    pbp.c
  * @author  MCD Application Team
  * @brief   This file contains Public Broadcast Profile feature
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "cmsis_compiler.h"
#include "pbp_log.h"
#include "pbp_alloc.h"
#include "pbp.h"
#include "pbp_config.h"
#include "cap.h"
#include "stm32_mem.h"
/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private functions prototype------------------------------------------------*/

/* External functions prototype------------------------------------------------*/

/* Functions Definition ------------------------------------------------------*/

/* Public functions ----------------------------------------------------------*/
/**
  * @brief  Initialize the Public Broadcast Profile
  * @param  Role: PBP Role to initialize
  * @retval status of the initialization
  */
tBleStatus PBP_Init(PBP_Role_t Role)
{
  tBleStatus status = BLE_STATUS_SUCCESS;

  /*Check Role parameter*/
  if( (Role == 0) || (Role > (PBP_ROLE_PUBLIC_BROADCAST_SOURCE
                                                |PBP_ROLE_PUBLIC_BROADCAST_SINK
                                                  |PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)))
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 0u)
  if( (Role & PBP_ROLE_PUBLIC_BROADCAST_SOURCE) == PBP_ROLE_PUBLIC_BROADCAST_SOURCE)
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
#endif /*(BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 0u)*/

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 0u)
  if( (Role & PBP_ROLE_PUBLIC_BROADCAST_SINK) == PBP_ROLE_PUBLIC_BROADCAST_SINK)
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
#endif /*(BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 0u)*/

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 0u)
  if( (Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT) == PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
#endif /*(BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 0u)*/

  PBP_Context.Role = Role;
  PBP_Context.PBKScanState = PBP_PBK_SCAN_STATE_IDLE;
  PBP_Context.PBKPASyncState = PBP_PBK_PA_SYNC_STATE_IDLE;
  PBP_Context.PBKBIGSyncState = PBP_PBK_BIG_SYNC_STATE_IDLE;
  PBP_Context.PBAScanState = PBP_PBA_SCAN_STATE_IDLE;
  PBP_Context.PBAPASyncState = PBP_PBA_PA_SYNC_STATE_IDLE;
  PBP_Context.PBSState = PBP_PBS_STATE_IDLE;
  return status;
}

/**
  * @brief Perform a Broadcast Audio Start procedure using PBP requirements
  * @param pPBSBroadcastAudioStartParams: A pointer to the PBS Broadcast Audio Start Parameters Structure
  * @retval status of the operation
  */
tBleStatus PBP_PBS_BroadcastAudioStart(PBP_PBS_BroadcastAudioStart_Params_t *pPBSBroadcastAudioStartParams)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SOURCE)
  {
    uint8_t public_broadcast_announcement[12 + BLE_PBP_MAX_ADV_METADATA_SIZE + PBP_MAX_BROADCAST_NAME_SIZE
    + BLE_PBP_MAX_ADDITIONAL_ADV_DATA];
    uint8_t data_len = 0;

    if (pPBSBroadcastAudioStartParams->AdvMetadataLen > BLE_PBP_MAX_ADV_METADATA_SIZE
        || pPBSBroadcastAudioStartParams->BroadcastNameLen < 4 || pPBSBroadcastAudioStartParams->BroadcastNameLen > 32
          || pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->AdditionalAdvDataLen
            > BLE_PBP_MAX_ADDITIONAL_ADV_DATA)
    {
      return BLE_STATUS_INVALID_PARAMS;
    }

    /* Add Public Broadcast Announcement */
    public_broadcast_announcement[data_len++] = 5 + pPBSBroadcastAudioStartParams->AdvMetadataLen;
    public_broadcast_announcement[data_len++] = AD_TYPE_SERVICE_DATA;
    public_broadcast_announcement[data_len++] = PUBLIC_BROADCAST_ANNOUNCEMENT_SERVICE_UUID & 0xFF;
    public_broadcast_announcement[data_len++] = PUBLIC_BROADCAST_ANNOUNCEMENT_SERVICE_UUID >> 8;
    public_broadcast_announcement[data_len++] = pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->Encryption
      * PBP_FEATURES_ENCRYPTED| pPBSBroadcastAudioStartParams->StandardQuality * PBP_FEATURES_STANDARD_QUALITY
        | pPBSBroadcastAudioStartParams->HighQuality * PBP_FEATURES_HIGH_QUALITY;
    public_broadcast_announcement[data_len++] = pPBSBroadcastAudioStartParams->AdvMetadataLen;

    UTIL_MEM_cpy_8(&public_broadcast_announcement[data_len], pPBSBroadcastAudioStartParams->pAdvMetadata,
                   pPBSBroadcastAudioStartParams->AdvMetadataLen);
    data_len += pPBSBroadcastAudioStartParams->AdvMetadataLen;

    /* Add Appearance */
    public_broadcast_announcement[data_len++] = 3;
    public_broadcast_announcement[data_len++] = AD_TYPE_APPEARANCE;
    public_broadcast_announcement[data_len++] = pPBSBroadcastAudioStartParams->Appearance & 0xFF;
    public_broadcast_announcement[data_len++] = pPBSBroadcastAudioStartParams->Appearance >> 8;

    /* Add Broadcast Name */
    if (pPBSBroadcastAudioStartParams->BroadcastNameLen > 0)
    {
      public_broadcast_announcement[data_len++] = pPBSBroadcastAudioStartParams->BroadcastNameLen + 1;
      public_broadcast_announcement[data_len++] = AD_TYPE_BROADCAST_NAME;
      UTIL_MEM_cpy_8(&public_broadcast_announcement[data_len], pPBSBroadcastAudioStartParams->pBroadcastName,
                     pPBSBroadcastAudioStartParams->BroadcastNameLen);
      data_len += pPBSBroadcastAudioStartParams->BroadcastNameLen;
    }

    /* Copy Additional Data */
    UTIL_MEM_cpy_8(&public_broadcast_announcement[data_len],
                   pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->pAdditionalAdvData,
                   pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->AdditionalAdvDataLen);
    data_len += pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->AdditionalAdvDataLen;

    pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->pAdditionalAdvData = &public_broadcast_announcement[0];
    pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams->AdditionalAdvDataLen = data_len;

    ret = CAP_Broadcast_AudioStart(pPBSBroadcastAudioStartParams->pBroadcastAudioStartParams);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u) */
  return ret;

