STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/AudioUseCases/pbp.c
}

/**
  * @brief Perform the Broadcast Audio Stop procedure
  * @param BigHandle: Handle of the BIG of the Broadcast Source to stop
  * @param Release: 0x00 to perform Disable operation, 0x01 to perform Release operation
  * @retval status of the operation
  */
tBleStatus PBP_PBS_BroadcastAudioStop(uint8_t BigHandle, uint8_t Release)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SOURCE)
  {
    ret = CAP_Broadcast_AudioStop(BigHandle, Release);
    PBP_Context.WaitForAudioDown = 1u;
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u) */
  return ret;
}

/**
  * @brief Perform the Broadcast Audio Update procedure
  * @param AdvHandle: Handle of the periodic advertising of the broadcast source
  * @param pBASEGroup: Pointer to the BASE Group for the broadcast source
  * @retval status of the operation
  */
tBleStatus PBP_PBS_BroadcastAudioUpdate(uint8_t AdvHandle, BAP_BASE_Group_t *pBASEGroup)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SOURCE)
  {
    ret = CAP_Broadcast_AudioUpdate(AdvHandle, pBASEGroup);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SOURCE_ROLE == 1u) */
  return ret;
}

/**
 * @brief Start the parsing of Extended Advertising Reports to look for PBP UUIDs and generate
 *        PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT events
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StartAdvReportParsing(void)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK
      && PBP_Context.PBKScanState == PBP_PBK_SCAN_STATE_IDLE)
  {
    ret = CAP_Broadcast_StartAdvReportParsing();
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKScanState = PBP_PBK_SCAN_STATE_SCANNING;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Stops the parsing of Extended Advertising Reports to look for PBP UUIDs
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StopAdvReportParsing(void)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK
      && PBP_Context.PBKScanState == PBP_PBK_SCAN_STATE_SCANNING)
  {
    ret = CAP_Broadcast_StopAdvReportParsing();
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKScanState = PBP_PBK_SCAN_STATE_IDLE;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Synchronize to the periodic advertising train of the given device to discover more details about the
 *   related audio stream
 * @param AdvSid: ahe Advertising Set ID of the periodic advertising train to synchronize to
 * @param pAdvAddress: a pointer to the address of the advertising device
 * @param pAddressType: Type of the peer address: 0x00 for Public, 0x01 for Random
 * @param Skip: Number of Periodic Advertising Events skippable
 * @param SyncTimeout: Synchronization Timeout
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StartPASync(uint8_t AdvSid, const uint8_t *pAdvAddress, uint8_t pAddressType, uint16_t Skip,
                               uint16_t SyncTimeout)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK)
  {
    ret = CAP_Broadcast_StartPASync(AdvSid, pAdvAddress, pAddressType, Skip, SyncTimeout);
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKPASyncState = PBP_PBK_PA_SYNC_STATE_SYNCHRONIZING;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Synchronize to a BIG and start receiving data from it
 * @param BigHandle: the handle of the BIG
 * @param SyncHandle: The handle of the periodic advertising train related to the BIG
 * @param pBisIndex: an array of the BIS index of the BIG to synchronize to
 * @param NumBis: the number of BIS to synchronize
 * @param pGroup: a pointer to the BASE group related
 * @param SubgroupIndex: The index of the subgroup being synced
 * @param Encryption: 0x00 to disable encryption, 0x01 to enable it
 * @param BroadcastCode: Broadcast code for the encryption
 * @param MSE: Maximum of Sub Events Used
 * @param Timeout: BIG Synchronization Timeout
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StartBIGSync(uint8_t BigHandle,
                                uint16_t SyncHandle,
                                uint8_t *pBisIndex,
                                uint8_t NumBis,
                                BAP_BASE_Group_t *pGroup,
                                uint8_t SubgroupIndex,
                                uint8_t Encryption,
                                uint32_t *BroadcastCode,
                                uint8_t MSE,
                                uint16_t Timeout)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK)
  {
    ret = CAP_Broadcast_StartBIGSync(BigHandle, SyncHandle, pBisIndex,NumBis, pGroup,
                                     SubgroupIndex, Encryption, BroadcastCode, MSE, Timeout);
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKBIGSyncState = PBP_PBK_BIG_SYNC_STATE_SYNCHRONIZING;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Stop the synchronization to a periodic advertising train
 * @param SyncHandle: The handle of the Periodic Advertising train
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StopPASync(uint16_t SyncHandle)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK)
  {
    ret = CAP_Broadcast_StopPASync(SyncHandle);
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKPASyncState = PBP_PBK_PA_SYNC_STATE_IDLE;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Terminate the synchronization to a BIG
 * @param BigHandle: the handle of the BIG to terminate
 * @retval status of the operation
 */
tBleStatus PBP_PBK_StopBIGSync(uint8_t BigHandle)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

