STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/AudioUseCases/pbp.c
#if (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_SINK)
  {
    PBP_Context.WaitForAudioDown = 1u;
    ret = CAP_Broadcast_StopBIGSync(BigHandle);
    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBKBIGSyncState = PBP_PBK_BIG_SYNC_STATE_IDLE;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_SINK_ROLE == 1u) */
  return ret;
}

/**
 * @brief Start parsing Extended Advertising report to search for Scan Delagors solliciting assistance and Broadcast
 *        Sources on behalf a connected Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator. If no Scan Delegator is currently
 *                    connected, ignore this parameter
 * @retval status of the operation
*/
tBleStatus PBP_PBA_StartAdvReportParsing(uint16_t ConnHandle)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT
      && PBP_Context.PBAScanState == PBP_PBA_SCAN_STATE_IDLE)
  {
    ret = CAP_BroadcastAssistant_StartAdvReportParsing(ConnHandle);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Stop parsing Extended Advertising report to search for Scan Delagors solliciting assistance and Broadcast
 *        Sources on behalf a connected Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator. If no Scan Delegator is currently
 *                    connected, ignore this parameter
 * @retval status of the operation
*/
tBleStatus PBP_PBA_StopAdvReportParsing(uint16_t ConnHandle)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT
      && PBP_Context.PBAScanState == PBP_PBA_SCAN_STATE_SCANNING)
  {
    ret = CAP_BroadcastAssistant_StopAdvReportParsing(ConnHandle);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Add a Broadcast Source to the remote Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator
 * @param pBroadcastSource: A pointer to a BAP_BA_Broadcast_Source_Add_t structure containing details about the source to
 *                          add
 * @retval status of the operation
*/
tBleStatus PBP_PBA_AddBroadcastSource(uint16_t ConnHandle, BAP_BA_Broadcast_Source_Add_t *pBroadcastSource)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_AddBroadcastSource(ConnHandle, pBroadcastSource);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Modify a Broadcast Source on the remote Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator
 * @param pBroadcastSource: A pointer to a BAP_BA_Broadcast_Source_t structure containing details about the
 *                          source to modify
 * @retval status of the operation
*/
tBleStatus PBP_PBA_ModifyBroadcastSource(uint16_t ConnHandle,
                                                        BAP_BA_Broadcast_Source_Modify_t *pBroadcastSource)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_ModifyBroadcastSource(ConnHandle, pBroadcastSource);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Removes a Broadcast Source from a remote Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator
 * @param SourceId: The ID of the source to remove
 * @retval status of the operation
*/
tBleStatus PBP_PBA_RemoveBroadcastSource(uint16_t ConnHandle, uint8_t SourceId)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_RemoveBroadcastSource(ConnHandle, SourceId);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Send the broadcast code of a broadcast source to a remote Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator
 * @param SourceId: The ID of the Broadcast Source missing a Broadcast Code
 * @param pBroadcastCode: The 16 bytes broadcast code of the broadcast Source
 * @retval status of the operation
*/
tBleStatus PBP_PBA_SetBroadcastCode(uint16_t ConnHandle, uint8_t SourceId, uint32_t *pBroadcastCode)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_SetBroadcastCode(ConnHandle, SourceId, pBroadcastCode);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Perform a Scan Offload operation to transfer a Periodic Advertising Sync to a Scan Delegator
 * @param ConnHandle: The handle of the connection to the remote Scan Delegator
 * @param PAHandle: The handle of the periodic advertising train to transfer (synchandle or advhandle if local)
 * @param SourceId: The ID of the source to remove
 * @retval status of the operation
*/
tBleStatus PBP_PBA_ScanOffload(uint16_t ConnHandle, uint16_t PAHandle, uint8_t SourceId)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_ScanOffload(ConnHandle, PAHandle, SourceId);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Synchronize with a Periodic Advertising train to discover BASE info about a broadcast source
 * @param AdvSid: Advertising SID of the periodic advertising train to synchronize
 * @param pAdvAddress: Pointer to the address of the device doing periodic advertising
 * @param pAddressType: Type of the peer address: 0x00 for Public, 0x01 for Random
 * @param Skip: Number of Periodic Advertising Events skippable
 * @param SyncTimeout: Synchronization Timeout
 * @retval status of the operation
 */
tBleStatus PBP_PBA_StartPASync(uint8_t AdvSid, const uint8_t *pAdvAddress, uint8_t pAddressType, uint16_t Skip,
                               uint16_t SyncTimeout)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_StartPASync(AdvSid, pAdvAddress, pAddressType, Skip, SyncTimeout);

    if (ret == BLE_STATUS_SUCCESS)
    {
      PBP_Context.PBAPASyncState = PBP_PBA_PA_SYNC_STATE_SYNCHRONIZING;
    }
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
 * @brief Stop the synchronization to a periodic advertising train
 * @param SyncHandle: The handle of the Periodic Advertising train
 * @retval status of the operation
 */
tBleStatus PBP_PBA_StopPASync(uint16_t SyncHandle)
{
  tBleStatus ret = HCI_COMMAND_DISALLOWED_ERR_CODE;

#if (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u)
  if (PBP_Context.Role & PBP_ROLE_PUBLIC_BROADCAST_ASSISTANT)
  {
    ret = CAP_BroadcastAssistant_StopPASync(SyncHandle);
  }
#endif /* (BLE_CFG_PBP_PUBLIC_BROADCAST_ASSISTANT_ROLE == 1u) */
  return ret;
}

/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_PBP_Notification(CAP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case CAP_BROADCAST_AUDIOSTARTED_EVT:
    {
      PBP_Notification_Evt_t notif = {
          PBP_PBS_BROADCAST_AUDIO_STARTED_EVT,
          pNotification->Status,
          0,
          pNotification->pInfo
      };
      PBP_Notification(&notif);
      break;
    }
    case CAP_BROADCAST_AUDIOSTOPPED_EVT:
    {
      PBP_Notification_Evt_t notif = {
          PBP_PBS_BROADCAST_AUDIO_STOPPED_EVT,
          pNotification->Status,
          0,
          pNotification->pInfo
      };
      PBP_Notification(&notif);
      break;
    }
    case CAP_BROADCAST_SOURCE_ADV_REPORT_EVT:
    case CAP_BA_BROADCAST_SOURCE_ADV_REPORT_EVT:
    {
      uint8_t i = 0;
      uint8_t is_pbs = 0;
      BAP_Broadcast_Source_Adv_Report_Data_t *data = (BAP_Broadcast_Source_Adv_Report_Data_t *) pNotification->pInfo;
      PBP_Broadcast_Source_Adv_Report_Data_t info;

      /* Check if Broadcast Source contains the Public Broadcast Announcement Service */
      while (i + 1 < data->AdvertisingDataLength)
      {
        uint8_t length = data->pAdvertisingData[i];
        uint8_t type = data->pAdvertisingData[i+1];
        if (type == AD_TYPE_SERVICE_DATA
            && i+5 < data->AdvertisingDataLength
            && data->pAdvertisingData[i+2] == (PUBLIC_BROADCAST_ANNOUNCEMENT_SERVICE_UUID & 0xFF)
            && data->pAdvertisingData[i+3] == (PUBLIC_BROADCAST_ANNOUNCEMENT_SERVICE_UUID >> 8))
        {
          /* Found Public Broadcast Announcement Service */
          is_pbs = 1u;
          info.pBAPReport = data;
          info.Features = data->pAdvertisingData[i+4]
            & (PBP_FEATURES_ENCRYPTED | PBP_FEATURES_STANDARD_QUALITY | PBP_FEATURES_HIGH_QUALITY);
          info.MetadataLength = data->pAdvertisingData[i+5];
          if (i + 5 + info.MetadataLength >= data->AdvertisingDataLength)
          {
            /* Error in Advertising Data */
            return;
          }
          info.pMetadata = &(data->pAdvertisingData[i+6]);
        }
        else if (type == AD_TYPE_APPEARANCE
                 && i+3 < data->AdvertisingDataLength)
        {
          info.Appearance = data->pAdvertisingData[i+2] + (data->pAdvertisingData[i+3] << 8);
        }
        else if (type == AD_TYPE_BROADCAST_NAME
                 && i+2 < data->AdvertisingDataLength)
        {
          info.BroadcastNameLength = length - 1;
          if (i + 1 + info.BroadcastNameLength >= data->AdvertisingDataLength)
          {
            /* Error in Advertising Data */
            return;
          }
          info.pBroadcastName = &(data->pAdvertisingData[i+2]);
        }

        i+= length + 1;
      }

      if (is_pbs == 1u)
      {
        PBP_Notification_Evt_t notif = {
            PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT,
            pNotification->Status,
            0,
            (uint8_t *) &(info)
        };
        if (pNotification->EvtOpcode == CAP_BA_BROADCAST_SOURCE_ADV_REPORT_EVT)
        {
          notif.EvtOpcode = PBP_PBA_BROADCAST_SOURCE_ADV_REPORT_EVT;
        }
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_PA_SYNC_ESTABLISHED_EVT:
    {
      if (PBP_Context.PBKPASyncState == PBP_PBK_PA_SYNC_STATE_SYNCHRONIZING)
      {
        /* Event concerns a public broadcast source */
        PBP_Context.PBKPASyncState = PBP_PBK_PA_SYNC_STATE_SYNCHRONIZED;
        PBP_Notification_Evt_t notif = {
            PBP_PBK_PA_SYNC_ESTABLISHED_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_BASE_REPORT_EVT:
    {
      if (PBP_Context.PBKPASyncState == PBP_PBK_PA_SYNC_STATE_SYNCHRONIZED)
      {
        /* Event concerns a public broadcast source */
        PBP_Notification_Evt_t notif = {
            PBP_PBK_BASE_REPORT_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_BIGINFO_REPORT_EVT:
    {
      if (PBP_Context.PBKPASyncState == PBP_PBK_PA_SYNC_STATE_SYNCHRONIZED)
      {
        /* Event concerns a public broadcast source */
        PBP_Notification_Evt_t notif = {
            PBP_PBK_BIGINFO_REPORT_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_BIG_SYNC_ESTABLISHED_EVT:
    {
      if (PBP_Context.PBKBIGSyncState == PBP_PBK_BIG_SYNC_STATE_SYNCHRONIZING)
      {
        /* Event concerns a public broadcast source */
        PBP_Context.PBKBIGSyncState = PBP_PBK_BIG_SYNC_STATE_SYNCHRONIZED;
        PBP_Notification_Evt_t notif = {
            PBP_PBK_BIG_SYNC_ESTABLISHED_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_PA_SYNC_LOST_EVT:
    {
      if (PBP_Context.PBKPASyncState > PBP_PBK_PA_SYNC_STATE_IDLE)
      {
        /* Event concerns a public broadcast source */
        PBP_Context.PBKPASyncState = PBP_PBK_PA_SYNC_STATE_IDLE;
        PBP_Notification_Evt_t notif = {
            PBP_PBK_PA_SYNC_LOST_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_BIG_SYNC_LOST_EVT:
    {
      if (PBP_Context.PBKBIGSyncState > PBP_PBK_BIG_SYNC_STATE_IDLE)
      {
        /* Event concerns a public broadcast source */
        PBP_Context.PBKBIGSyncState = PBP_PBK_BIG_SYNC_STATE_IDLE;
        PBP_Context.WaitForAudioDown = 1u;
        PBP_Notification_Evt_t notif = {
            PBP_PBK_BIG_SYNC_LOST_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
    }
    case CAP_BROADCAST_AUDIO_UP_EVT:
    {
      if (PBP_Context.PBKBIGSyncState > PBP_PBK_BIG_SYNC_STATE_IDLE
          || PBP_Context.PBSState > PBP_PBS_STATE_IDLE)
      {
        /* Event concerns a public broadcast source */
        PBP_Notification_Evt_t notif = {
            PBP_BROADCAST_AUDIO_UP_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BROADCAST_AUDIO_DOWN_EVT:
    {
      if (PBP_Context.WaitForAudioDown == 1u)
      {
        /* Event concerns a public broadcast source */
        PBP_Context.WaitForAudioDown = 0u;
        PBP_Notification_Evt_t notif = {
            PBP_BROADCAST_AUDIO_DOWN_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BA_REM_BROADCAST_RECEIVE_STATE_INFO_EVT:
    {
      PBP_Notification_Evt_t notif = {
          PBP_PBA_REM_BROADCAST_RECEIVE_STATE_INFO_EVT,
          pNotification->Status,
          0,
          pNotification->pInfo
      };
      PBP_Notification(&notif);
      break;
    }
    case CAP_BA_REM_REMOVED_SOURCE_EVT:
    {
      PBP_Notification_Evt_t notif = {
          PBP_PBA_REM_REMOVED_SOURCE_EVT,
          pNotification->Status,
          0,
          pNotification->pInfo
      };
      PBP_Notification(&notif);
      break;
    }
    case CAP_BA_SOLICITING_SCAN_DELEGATOR_REPORT_EVT:
    {
      PBP_Notification_Evt_t notif = {
          PBP_PBA_SOLICITING_SCAN_DELEGATOR_REPORT_EVT,
          pNotification->Status,
          0,
          pNotification->pInfo
      };
      PBP_Notification(&notif);
      break;
    }
    case CAP_BA_PA_SYNC_ESTABLISHED_EVT:
    {
      if (PBP_Context.PBAPASyncState == PBP_PBA_PA_SYNC_STATE_SYNCHRONIZING)
      {
        PBP_Context.PBAPASyncState = PBP_PBA_PA_SYNC_STATE_SYNCHRONIZED;
        PBP_Notification_Evt_t notif = {
            PBP_PBA_PA_SYNC_ESTABLISHED_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BA_PA_SYNC_LOST_EVT:
    {
      if (PBP_Context.PBAPASyncState > PBP_PBA_PA_SYNC_STATE_IDLE)
      {
        PBP_Context.PBAPASyncState = PBP_PBA_PA_SYNC_STATE_IDLE;
        PBP_Notification_Evt_t notif = {
            PBP_PBA_PA_SYNC_LOST_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BA_BASE_REPORT_EVT:
    {
      if (PBP_Context.PBAPASyncState == PBP_PBA_PA_SYNC_STATE_SYNCHRONIZING)
      {
        PBP_Notification_Evt_t notif = {
            PBP_PBA_BASE_REPORT_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    case CAP_BA_BIGINFO_REPORT_EVT:
    {
      if (PBP_Context.PBAPASyncState == PBP_PBA_PA_SYNC_STATE_SYNCHRONIZING)
      {
        PBP_Notification_Evt_t notif = {
            PBP_PBA_BIGINFO_REPORT_EVT,
            pNotification->Status,
            0,
            pNotification->pInfo
        };
        PBP_Notification(&notif);
      }
      break;
    }
    default:
    {
      /* Ignore event */
      break;
    }
  }
}


/* Private functions ----------------------------------------------------------*/
